================
WebDAV Beispiele
================
Die folgenden Beispiele können mit ``cadaver``\ [#]_ nachvollzogen werden,
einem Kommandozeilen Client für WebDAV.
Alle Beispiele lassen sich auch mit graphischen Dateimanagern reproduzieren.
Bis auf Beispiel 5 lassen sich die Beispiele mit einem Internet-Browser
repoduzieren.

Ein laufender Tryton-Server ist folgendermaßen konfiguriert:

    * In der Datei ``trytond.conf`` sind folgende Einstellungen gesetzt:

      ``webdav = localhost:8000``

      ``ssl_webdav = False``

    * Es existiert eine Datenbank mit dem Namen 'firma'.
    * Das :ref:`party_module` Modul ist installiert.
    * Das Parteien Modell ist als WebDAV Sammlung unter dem Namen *Parteien*
      angelegt (siehe auch :ref:`webdav_collection`).
    * Es existiert eine lokale Bilddatei namens `Foto.jpg`.
    * Es wird der *admin* :ref:`res_user` verwendet.

.. [#] http://www.webdav.org/cadaver/


Beispiel 1
==========
Verbindung zu einem WebDAV-Service mit ``cadaver``::

    $ cadaver http://localhost:8080/
    Authentication required for PyWebDAV on server `localhost':
    Username: admin
    Password:
    dav:/>


Beispiel 2
==========
Verfügbare Komandos von ``cadaver``::

    dav:/> help
    Available commands:
    ls       cd       pwd        put      get    mget       mput
    edit     less     mkcol      cat      delete rmcol      copy
    move     lock     unlock     discover steal  showlocks  version
    checkin  checkout uncheckout history  label  propnames  chexec
    propget  propdel  propset    search   set    open       close
    echo     quit     unset      lcd      lls    lpwd       logout
    help     describe about
    Aliases: rm=delete, mkdir=mkcol, mv=move, cp=copy, more=less,
    quit=exit=bye


Beispiel 3
==========
Entfernte Sammlung/Verzeichnis (Collection) listen (Verzeichnisansicht)::

    dav:/> ls
    Listing collection `/': succeeded.
    Coll:   firma                                  0  Mär  2 00:25

Lokales Verzeichnis listen (Verzeichnisansicht)::

    dav:/> lls
    Foto.jpg


Beispiel 4
==========
In eine Sammlung/Verzeichnis wechseln::

    dav:/> cd firma
    dav:/firma/> ls
    Listing collection `/firma/': succeeded.
    Coll:   Parteien                               0  Mär  2 00:25

    dav:/firma/> cd Parteien
    dav:/firma/Parteien/> ls
    Listing collection `/firma/Parteien/': succeeded.
    Coll:   Kuni Gunde-6                           0  Mär  2 00:25
    Coll:   Farnsworth-7                           0  Mär  2 00:25
    Coll:   Telekom-5                              0  Mär  2 00:25
    Coll:   Preisler, Korbinian-4                  0  Mär  2 00:25
    Coll:   Firma-1                                0  Mär  2 00:25
    Coll:   Spallek, Udo-3                         0  Mär  2 00:25
    Coll:   virtual things-2                       0  Mär  2 00:25

    dav:/firma/Parteien/> cd Spallek, Udo-3
    The `cd' command takes at most 1 argument:
      cd path : Change to specified collection

    dav:/firma/Parteien/> cd Spallek,\ Udo-3
    dav:/firma/Parteien/Spallek, Udo-3/> ls
    Listing collection `/firma/Parteien/Spallek%2c%20Udo-3/': succeeded.
            Brief-255.odt                          0  Mär  2 00:25
            Labels-68.odt                          0  Mär  2 00:25


.. note:: In ``cadaver`` müssen Leerzeichen mit einem Blackslash ``\``
          maskiert werden.

Berichte aus Tryton stehen mit den aktuellen Systemdaten als Sammlung
zum Download bereit. Diese automatisch erzeugten WebDAV-Sammlungen können
nicht gelöscht werden und stehen grundsätzlich allen Benutzern zur
Verfügung.


Beispiel 5
==========
Hinzufügen eines Fotos von einem lokalen Verzeichnis zur Sammlung::

    dav:/firma/Parteien/Spallek, Udo-3/> put Foto.jpg
    Uploading Foto.jpg to
    `/firma/Parteien/Spallek%2c%20Udo-3/Foto.jpg':
    Progress: [==========================>] 100,0% of 8696 bytes succeeded.
    dav:/firma/Parteien/Spallek, Udo-3/> ls
    Listing collection `/firma/Parteien/Spallek%2c%20Udo-3/': succeeded.
            Brief-255.odt                          0  Mär  2 00:25
            Foto.jpg                            8696  Mär  1 00:26
            Labels-68.odt                          0  Mär  2 00:25

Das hochgeladene Bild wird in Tryton der Partei ``Spallek, Udo`` automatisch
als Anhang zur Verfügung gestellt.


Beispiel 6
==========
Eine WebDAV-Sammlung lokal herunterladen::

        dav:/firma/Parteien/Spallek, Udo-3/> mget Labels-68.odt
        Downloading `/firma/Parteien/Spallek%2c%20Udo-3/Labels-68.odt'
        to Labels-68.odt':
        Progress: [========================>] 100,0% of 25394 bytes succeeded.

        dav:/firma/Parteien/Spallek, Udo-3/> lls
        Foto.jpg    Labels-68.odt


